xemacs/elpa/pkgs/org-onchange/org-onchange.org
#+TITLE Org on change
#+PROPERTY: header-args :tangle yes :padline yes :comments both :noweb yes

* Org on change
** Preamble
 #+BEGIN_SRC emacs-lisp
;;; org-onchange.el --- copy config

;; Copyright (C) 2012  Sharad Pratap

;; Author: Sharad Pratap <sh4r4d _at_ _G-mail_>
;; Author: Sharad Pratap <sh4r4d _at_ _G-mail_>
;; Keywords: convenience

;; This program is free software; you can redistribute it and/or modify
;; it under the terms of the GNU General Public License as published by
;; the Free Software Foundation, either version 3 of the License, or
;; (at your option) any later version.

;; This program is distributed in the hope that it will be useful,
;; but WITHOUT ANY WARRANTY; without even the implied warranty of
;; MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
;; GNU General Public License for more details.

;; You should have received a copy of the GNU General Public License
;; along with this program.  If not, see <http://www.gnu.org/licenses/>.

;;; Commentary:

;;; Code:

 #+END_SRC

** Libraries required

#+BEGIN_SRC emacs-lisp
(require 'desktop)
(require 'session)

(require 'timer-utils-lotus)
(eval-when-compile
  (require 'timer-utils-lotus))
(require 'org-misc-utils-lotus)
(eval-when-compile
  (require 'org-misc-utils-lotus))
(require 'lotus-misc-utils)
(eval-when-compile
  (require 'lotus-misc-utils))
#+END_SRC

** Functions

*** Base functions
**** Note start
 (defun org-add-note ()
   "Add a note to the current entry.
 This is done in the same way as adding a state change note."
   (interactive)
   (org-add-log-setup 'note))

**** org-add-log-setup (&optional purpose state prev-state how extra)
 Set up the post command hook to take a note.
 If this is about to TODO state change, the new state is expected in STATE.
 HOW is an indicator what kind of note should be created.
 EXTRA is additional text that will be inserted into the notes buffer.
#+BEGIN_SRC emacs-lisp :tangle no
  (defun org-add-log-setup (&optional purpose state prev-state how extra)
    "Set up the post command hook to take a note.
  If this is about to TODO state change, the new state is expected in STATE.
  HOW is an indicator what kind of note should be created.
  EXTRA is additional text that will be inserted into the notes buffer."
    (move-marker org-log-note-marker (point))
    (setq org-log-note-purpose purpose
          org-log-note-state state
          org-log-note-previous-state prev-state
          org-log-note-how how
          org-log-note-extra extra
          org-log-note-effective-time (org-current-effective-time))
    (add-hook 'post-command-hook 'org-add-log-note 'append))

#+END_SRC

**** org-add-log-note (&optional _purpose)
 Pop up a window for taking a note, and add this note later.
 (setq-local org-finish-function 'org-store-log-note)
#+BEGIN_SRC elisp :tangle no
  (defun org-add-log-note (&optional _purpose)
    "Pop up a window for taking a note, and add this note later."
    (remove-hook 'post-command-hook 'org-add-log-note)
    (setq org-log-note-window-configuration (current-window-configuration))
    (delete-other-windows)
    (move-marker org-log-note-return-to (point))
    (pop-to-buffer-same-window (marker-buffer org-log-note-marker))
    (goto-char org-log-note-marker)
    (org-switch-to-buffer-other-window "*Org Note*")
    (erase-buffer)
    (if (memq org-log-note-how '(time state))
        (org-store-log-note)
      (let ((org-inhibit-startup t)) (org-mode))
      (insert (format "# Insert note for %s.
  # Finish with C-c C-c, or cancel with C-c C-k.\n\n"
          (cond
           ((eq org-log-note-purpose 'clock-out) "stopped clock")
           ((eq org-log-note-purpose 'done)  "closed todo item")
           ((eq org-log-note-purpose 'state)
            (format "state change from \"%s\" to \"%s\""
              (or org-log-note-previous-state "")
              (or org-log-note-state "")))
           ((eq org-log-note-purpose 'reschedule)
            "rescheduling")
           ((eq org-log-note-purpose 'delschedule)
            "no longer scheduled")
           ((eq org-log-note-purpose 'redeadline)
            "changing deadline")
           ((eq org-log-note-purpose 'deldeadline)
            "removing deadline")
           ((eq org-log-note-purpose 'refile)
            "refiling")
           ((eq org-log-note-purpose 'note)
            "this entry")
           (t (error "This should not happen")))))
      (when org-log-note-extra (insert org-log-note-extra))
      (setq-local org-finish-function 'org-store-log-note)
      (run-hooks 'org-log-buffer-setup-hook)))
#+END_SRC

**** org-store-log-note ()
 Finish taking a log note, and insert it to where it belongs.
#+BEGIN_SRC elisp :tangle no
  (defvar org-note-abort nil) ; dynamically scoped
  (defun org-store-log-note ()
    "Finish taking a log note, and insert it to where it belongs."
    (let ((txt (prog1 (buffer-string)
                 (kill-buffer)))
          (note (cdr (assq org-log-note-purpose org-log-note-headings)))
          lines)
      (while (string-match "\\`# .*\n[ \t\n]*" txt)
        (setq txt (replace-match "" t t txt)))
      (when (string-match "\\s-+\\'" txt)
        (setq txt (replace-match "" t t txt)))
      (setq lines (and (not (equal "" txt)) (org-split-string txt "\n")))
      (when (org-string-nw-p note)
        (setq note
              (org-replace-escapes
               note
               (list (cons "%u" (user-login-name))
                     (cons "%U" user-full-name)
                     (cons "%t" (format-time-string
                                 (org-time-stamp-format 'long 'inactive)
                                 org-log-note-effective-time))
                     (cons "%T" (format-time-string
                                 (org-time-stamp-format 'long nil)
                                 org-log-note-effective-time))
                     (cons "%d" (format-time-string
                                 (org-time-stamp-format nil 'inactive)
                                 org-log-note-effective-time))
                     (cons "%D" (format-time-string
                                 (org-time-stamp-format nil nil)
                                 org-log-note-effective-time))
                     (cons "%s" (cond
                                  ((not org-log-note-state) "")
                                  ((string-match-p org-ts-regexp
                                                   org-log-note-state)
                                   (format "\"[%s]\""
                                           (substring org-log-note-state 1 -1)))
                                  (t (format "\"%s\"" org-log-note-state))))
                     (cons "%S"
                           (cond
                             ((not org-log-note-previous-state) "")
                             ((string-match-p org-ts-regexp
                                              org-log-note-previous-state)
                              (format "\"[%s]\""
                                      (substring
                                       org-log-note-previous-state 1 -1)))
                             (t (format "\"%s\""
                                        org-log-note-previous-state)))))))
        (when lines (setq note (concat note " \\\\")))
        (push note lines))
      (when (and lines (not org-note-abort))
        (with-current-buffer (marker-buffer org-log-note-marker)
          (org-with-wide-buffer
           ;; Find location for the new note.
           (goto-char org-log-note-marker)
           (set-marker org-log-note-marker nil)
           ;; Note associated to a clock is to be located right after
           ;; the clock.  Do not move point.
           (unless (eq org-log-note-purpose 'clock-out)
             (goto-char (org-log-beginning t)))
           ;; Make sure point is at the beginning of an empty line.
           (cond ((not (bolp)) (let ((inhibit-read-only t)) (insert "\n")))
                 ((looking-at "[ \t]*\\S-") (save-excursion (insert "\n"))))
           ;; In an existing list, add a new item at the top level.
           ;; Otherwise, indent line like a regular one.
           (let ((itemp (org-in-item-p)))
             (if itemp
                 (indent-line-to
                  (let ((struct (save-excursion
                                  (goto-char itemp) (org-list-struct))))
                    (org-list-get-ind (org-list-get-top-point struct) struct)))
                 (org-indent-line)))
           (insert (org-list-bullet-string "-") (pop lines))
           (let ((ind (org-list-item-body-column (line-beginning-position))))
             (dolist (line lines)
               (insert "\n")
               (indent-line-to ind)
               (insert line)))
           (message "Note stored")
           (org-back-to-heading t)
           (org-cycle-hide-drawers 'children))
          ;; Fix `buffer-undo-list' when `org-store-log-note' is called
          ;; from within `org-add-log-note' because `buffer-undo-list'
          ;; is then modified outside of `org-with-remote-undo'.
          (when (eq this-command 'org-agenda-todo)
            (setcdr buffer-undo-list (cddr buffer-undo-list))))))
    ;; Don't add undo information when called from `org-agenda-todo'.
    (let ((buffer-undo-list (eq this-command 'org-agenda-todo)))
      (set-window-configuration org-log-note-window-configuration)
      (with-current-buffer (marker-buffer org-log-note-return-to)
        (goto-char org-log-note-return-to))
      (move-marker org-log-note-return-to nil)
      (when org-log-post-message (message "%s" org-log-post-message))))
#+END_SRC


